Repository: dinaraparanid/ListyChef
Catalog: lib/l10n/app_*.arb
Languages: ru

source: OK
ru: ОК

source: Cancel
ru: Отмена

source: Error
ru: Ошибка

source: Yes
ru: Да

source: No
ru: Нет

# auth_welcome_title
source: Welcome to Listy Chef!
ru: Добро пожаловать в Listy Chef!

# auth_email_label
source: Email
ru: Электронная почта

# auth_nickname_label
source: Nickname
ru: Никнейм

# auth_password_label
source: Password
ru: Пароль

# auth_sign_in
source: Sign In
ru: Войти

# auth_sign_up
source: Sign Up
ru: Зарегистрироваться

# auth_error_email_empty
source: Email must not be empty
ru: Электронная почта не должна быть пустой

# auth_error_nickname_empty
source: Nickname must not be empty
ru: Никнейм не должен быть пустым

# auth_error_short_password
source: Password must contain at least 8 symbols
ru: Пароль должен содержать от 8 символов

# auth_error_invalid_email
source: Invalid email
ru: Неверный адрес электронной почты

# auth_error_user_disabled
source: Your account is disabled
ru: Ваш аккаунт отключён

# auth_error_wrong_password
source: Invalid password
ru: Неверный пароль

# auth_error_too_many_requests
source: Too many requests. Try again later
ru: Превышено количество запросов. Попробуйте снова позже

# auth_error_user_token_expired
source: The maximum session duration has been exceeded. To continue, please log in again.
ru: Максимальная продолжительность сессии превышена. Для продолжения войдите повторно

# auth_error_network_request_failed
source: Failed to make a network request. Please, check your internet connection
ru: Ошибка сетевого соединения. Проверьте подключение к Интернету

# auth_error_invalid_credential
source: Invalid credentials. Please, try again
ru: Недействительные данные для входа. Пожалуйста, попробуйте ещё раз

# auth_error_weak_password
source: Password must be stronger
ru: Пароль недостаточно сложный

# auth_error_unknown
source: Unknown error. Please, try again
ru: Неизвестная ошибка. Повторите попытку позднее

# auth_error_user_not_found
source: Account with email `{email}` does not exist
ru: Аккаунта с указанным email {email} не существует

# auth_error_email_already_in_use
source: User with email `{email}` already exists. Do you want to sign in?
ru: Пользователь с email `{email}` уже существует. Хотите войти?
